/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mogawa <mogawa@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/11 10:38:09 by mogawa            #+#    #+#             */
/*   Updated: 2023/05/24 11:45:52 by mogawa           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
引数| VOID型の文字列:*s＆バイト数:size_t n
戻り値| なし
フリー| 不要
機能| 文字列ｓにｎバイト分の０を書き込む
*/
void	ft_bzero(void *s, size_t n)
{
	ft_memset(s, 0, n);
}
